---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.HasLining
source: html/c4277620-5abe-d945-cc21-902df989d00d.htm
---
# Autodesk.Revit.DB.FabricationPart.HasLining Property

True if the fabrication part is lined.

## Syntax (C#)
```csharp
public bool HasLining { get; }
```